#!/bin/bash
# ==================================================================
#     ___                     __
#    /   |  ____  ____ ______/ /_  ___
#   / /| | / __ \/ __ \`/ ___/ __ \/ _ \
#  / ___ |/ /_/ / /_/ / /__/ / / /  __/
# /_/  |_/ .___/\__,_/\___/_/ /_/\___/
#       /_/
#  :: Apache ::              (v${HTTPD_VERSION})
#
# ----------------------------------------------------------------------------------------------------------------------
# Exit on error
set -e

# ----------------------------------------------------------------------------------------------------------------------
# shopt은 shell option의 약자로 유틸이다.
# 사용 하는 extglob 쉘 옵션 shopt 내장 명령을 사용 하 여 같은 확장된 패턴 일치 연산자를 사용
shopt -s extglob

PRG="$0"
while [[ -h "$PRG" ]]; do
    ls=`ls -ld "$PRG"`
    link=`expr "$ls" : '.*-> \(.*\)$'`
    if expr "$link" : '/.*' > /dev/null; then
        PRG="$link"
    else
        PRG=`dirname "$PRG"`/"$link"
    fi
done
PRGDIR=`dirname "$PRG"`
PRGDIR=`cd "$PRGDIR/.." >/dev/null; pwd`

# ----------------------------------------------------------------------------------------------------------------------
# 현재 사용자의 아이디명과 그룹정보
USERNAME=`id -u -n`
GROUPNAME=`id -g -n`

# ----------------------------------------------------------------------------------------------------------------------
# check_run_thread.sh
sed -i "s/for pid in.*/for pid in \`ps aux | grep httpd | grep ${USERNAME} | grep -v grep | grep -v status | grep -v rotatelogs | awk '{print \$2}'\`; do/g" ${PRGDIR}/bin/check_run_thread.sh

# ----------------------------------------------------------------------------------------------------------------------
# log_delete.sh
sed -i "s/USER=.*/USER=${USERNAME}/g"    ${PRGDIR}/bin/*.sh
sed -i "s/GROUP=.*/GROUP=${GROUPNAME}/g" ${PRGDIR}/bin/*.sh

# ----------------------------------------------------------------------------------------------------------------------
# Apache Config 수정.
sed -i "s/User.*/User ${USERNAME}/g"    ${PRGDIR}/conf/httpd.conf
sed -i "s/Group.*/Group ${GROUPNAME}/g" ${PRGDIR}/conf/httpd.conf

# ----------------------------------------------------------------------------------------------------------------------
printf "\e[00;32m|---------------------------------------------------------------------------------\e[00m\n"
printf "\e[00;32m| \"${HTTPD_ALIAS}\" config update success...\e[00m\n"
printf "\e[00;32m|---------------------------------------------------------------------------------\e[00m\n"

